"""
9. Користувачем вводиться початковий і кінцевий рік.
Створити цикл, який виведе всі високосні роки в цьому проміжку (границі включно).
P.S. Рік є високосним, якщо він кратний 4,
але не кратний 100, а також якщо він кратний 400.
"""

n_1, n_2 = map(int, input('Введіть 2 числа через пробіл \n').split())

for i in range(n_1, n_2 + 1):
    leap = False
    if i % 4 == 0 or i % 400 == 0:
        leap = True
    if i % 100 == 0 and i % 400 != 0:
        leap = False   
    if leap:
        print(i)