"""
2. Створіть 3 рiзних функцiї (на ваш вибiр). Кожна з цих функцiй повинна
повертати якийсь результат (напр. інпут від юзера, результат математичної операції
тощо). Також створiть четверту ф-цiю, яка всередині викликає 3 попередні,
обробляє їх результат та також повертає результат своєї роботи.
Таким чином ми будемо викликати одну (четверту) функцiю,
а вона в своєму тiлi - ще 3.
"""

def func_1():
    a, b = map(int, input('Введіть 2 числа через пробіл \n').split())
    return a + b

def func_2():
    return 'Hello world'

def func_3():
    s = input('Введіть якийсь текст \n')
    return s

def func_4():
    return f'''Результат роботи функції №1 - сума введених чисел = {func_1()} \n
Результат роботи функції №2 - просто {func_2()} :) \n
Результат роботи функції №3 - ви ввели текст "{func_3()}"'''

print(func_4())
    
    